# SetValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyList..::..SetValue Method
AssetPropertyList Class See Also
---
Sets collection of properties stored in this property list.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetValue(
	IList<AssetProperty> value
)
```

Visual Basic
---
```text
Public Sub SetValue ( _
	value As IList(Of AssetProperty) _
)
```

Visual C++
---
```text
public:
void SetValue(
	IList<AssetProperty^>^ value
)
```

# ### Parameters
value
    Type: System.Collections.Generic..::..IList<(Of <(<'AssetProperty>)>)> An array of properties.
# Remarks
All the properties in the list are of the same AssetPropertyType. The AssetPropertyType can only be Integer, Double4, Float or Double, Enumeration.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The input value is invalid for this AssetPropertyList property. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The asset property is not editable. |

# See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace